nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso55s36/common/pin_mux/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: LPC55S36
package_id: LPC55S36JBD100
mcu_data: ksdk2_0
processor_version: 0.15.7
board: LPCXpresso55S36
expansion_headers:
- id: frdm_arduino
  name: Freedom Header (Arduino compatible)
  connectors:
  - id: C1
    name: J102
    pins:
    - {id: 1, pin_num: '89', pin_signal: PIO0_6/FC3_SCK/CT_INP13/CTIMER4_MAT0/SCT_GPI6/FLEXSPI0_DATA0/SCT0_OUT6/FC7_RXD_SDA_MOSI_DATA/SECURE_GPIO0_6/PWM0_B0/EXTTRIG_IN1}
    - {id: 3, pin_num: '81', pin_signal: PIO0_2/FC3_TXD_SCL_MISO_WS/CT_INP1/SCT0_OUT0/SCT_GPI2/FLEXSPI0_DATA3/SECURE_GPIO0_2/PWM0_A2/TRIGOUT_3/EXTTRIG_IN4}
    - {id: 4, name: 3.3V, external_signal_types: power_supply_3.3V}
    - {id: 5, pin_num: '92', pin_signal: PIO1_31/MCLK/CTIMER0_MAT2/SCT0_OUT6/USB0_VBUS/PWM1_B2/EXTTRIG_IN2}
    - {id: 6, pin_num: '34', pin_signal: RESETN}
    - {id: 7, pin_num: '77', pin_signal: PIO1_25/FC2_TXD_SCL_MISO_WS/SCT0_OUT2/UTICK_CAP0/PWM1_A2/SPI_SCLK/AOI0_OUT3}
    - {id: 8, name: 3.3V, external_signal_types: power_supply_3.3V}
    - {id: 9, pin_num: '76', pin_signal: PIO0_21/FC3_RTS_SCL_SSEL1/UTICK_CAP3/CTIMER3_MAT3/SCT_GPI3/SCT0_OUT7/FLEXSPI0_SS0_N/FC7_SCK/HS_SPI_SSEL3/FC7_CTS_SDA_SSEL0/SECURE_GPIO0_21/PWM1_B1/TRIGOUT_4/EXTTRIG_IN7}
    - {id: 10, name: 5V, external_signal_types: power_supply_5V}
    - {id: 11, pin_num: '49', pin_signal: PIO1_23/FC2_SCK/SCT0_OUT0/FC3_SSEL2/PWM1_A1/TRIGOUT_4/HSCMP2_IN1}
    - {id: 12, name: GND, external_signal_types: ground}
    - {id: 13, pin_num: '84', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI_DATA/CTIMER0_MAT1/SCT0_OUT1/SCT_GPI3/FLEXSPI0_DATA2/SECURE_GPIO0_3/PWM1_B0}
    - {id: 14, name: GND, external_signal_types: ground}
    - {id: 15, pin_num: '37', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI_DATA/PWM1_A0/TRIGOUT_1}
    - {id: 16, external_signal_types: power_supply_5V}
  - id: C2
    name: J92
    pins:
    - {id: 1, pin_num: '10', pin_signal: PIO0_12/FC3_TXD_SCL_MISO_WS/FREQME_GPIO_CLK_B/SCT_GPI7/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_12/AOI1_OUT1/ADC1_3A}
    - {id: 2, pin_num: '86', pin_signal: PIO1_27/FC2_RTS_SCL_SSEL1/CTIMER0_MAT3/CLKOUT/FLEXSPI0_DATA6/CAN0_TD/PWM1_B2}
    - {id: 3, pin_num: '5', pin_signal: PIO0_1/FC3_CTS_SDA_SSEL0/CT_INP0/SCT_GPI1/PDM_CLK0/CMP0_OUT/SECURE_GPIO0_1/AOI0_OUT1/ADC1_2B}
    - {id: 4, pin_num: '80', pin_signal: PIO1_29/FC7_RXD_SDA_MOSI_DATA/SCT_GPI6/FLEXSPI0_DATA7/PWM0_X2/EXTTRIG_IN9}
    - {id: 5, pin_num: '4', pin_signal: PIO1_7/FC0_RTS_SCL_SSEL1/CTIMER2_MAT2/SCT_GPI4/AOI1_OUT3/ADC1_3B}
    - {id: 6, pin_num: '68', pin_signal: PIO1_26/FC2_CTS_SDA_SSEL0/SCT0_OUT3/CT_INP3/UTICK_CAP1/HS_SPI_SSEL3/PWM0_A1/QSPI_CS1_DIS/AOI1_OUT2}
    - {id: 7, pin_num: '7', pin_signal: ADC1IN1B}
    - {id: 8, pin_num: '60', pin_signal: PIO0_26/TAMPER2/FC2_RXD_SDA_MOSI_DATA/CLKOUT/CT_INP14/SCT0_OUT5/PDM_CLK0/USB0_IDVALUE/FC0_SCK/HS_SPI_MOSI/SECURE_GPIO0_26/PWM0_B1}
    - {id: 9, pin_num: '39', pin_signal: PIO1_10/FC1_RXD_SDA_MOSI_DATA/CTIMER1_MAT0/SCT0_OUT3/PWM0_X1/TRIGOUT_3/HSCMP2_OUT/HSCMP1_IN3}
    - {id: 10, pin_num: '62', pin_signal: PIO1_3/CAN0_RD/FC2_TXD_SCL_MISO_WS/SCT0_OUT4/PDM_DATA1/HS_SPI_MISO/USB0_PORTPWRN/PWM0_A3}
    - {id: 12, pin_num: '61', pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT_GPI6/PDM_CLK1/HS_SPI_SCK/PWM0_B0/AOI0_OUT0}
    - {id: 14, name: GND, external_signal_types: ground}
    - {id: 16, name: AREF, external_signal_types: aref}
    - {id: 18, pin_num: '84', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI_DATA/CTIMER0_MAT1/SCT0_OUT1/SCT_GPI3/FLEXSPI0_DATA2/SECURE_GPIO0_3/PWM1_B0}
    - {id: 20, pin_num: '81', pin_signal: PIO0_2/FC3_TXD_SCL_MISO_WS/CT_INP1/SCT0_OUT0/SCT_GPI2/FLEXSPI0_DATA3/SECURE_GPIO0_2/PWM0_A2/TRIGOUT_3/EXTTRIG_IN4}
  - id: C3
    name: J122
    pins:
    - {id: 2, pin_num: '24', pin_signal: PIO2_0/FC0_RXD_SDA_MOSI_DATA/CT_INP4/I3C0_PUR/AOI0_OUT0/ADC0_9A}
    - {id: 3, pin_num: '79', pin_signal: PIO0_25/FC0_TXD_SCL_MISO_WS/CT_INP9/SCT_GPI1/FLEXSPI0_DQS/HSCMP0_OUT/SECURE_GPIO0_25/PWM0_A0/EXTTRIG_IN6}
    - {id: 4, pin_num: '1', pin_signal: PIO2_1/FC0_TXD_SCL_MISO_WS/CTIMER1_MAT0/I3C0_SDA/AOI0_OUT2/OPAMP2_INP}
    - {id: 6, pin_num: '68', pin_signal: PIO1_26/FC2_CTS_SDA_SSEL0/SCT0_OUT3/CT_INP3/UTICK_CAP1/HS_SPI_SSEL3/PWM0_A1/QSPI_CS1_DIS/AOI1_OUT2}
    - {id: 8, pin_num: '49', pin_signal: PIO1_23/FC2_SCK/SCT0_OUT0/FC3_SSEL2/PWM1_A1/TRIGOUT_4/HSCMP2_IN1}
    - {id: 10, pin_num: '36', pin_signal: PIO1_8/FC0_CTS_SDA_SSEL0/SCT0_OUT1/FC4_SSEL2/FC1_SCK/PWM0_A2/AOI1_OUT2/TRIGOUT_6}
    - {id: 12, pin_num: '77', pin_signal: PIO1_25/FC2_TXD_SCL_MISO_WS/SCT0_OUT2/UTICK_CAP0/PWM1_A2/SPI_SCLK/AOI0_OUT3}
    - {id: 14, pin_num: '6', pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/CT_INP2/SCT_GPI4/AOI1_OUT0/ADC1_0B}
    - {id: 16, pin_num: '72', pin_signal: PIO1_28/FC7_SCK/CT_INP2/TRIGOUT_4/PWM1_X3/SPI_CS1_DIS/HSCMP1_OUT}
  - id: C4
    name: J132
    pins:
    - {id: 2, pin_num: '22', pin_signal: PIO0_15/FC6_CTS_SDA_SSEL0/UTICK_CAP2/CT_INP16/SCT0_OUT2/SECURE_GPIO0_15/ADC0_3A}
    - {id: 4, pin_num: '20', pin_signal: PIO0_16/FC4_TXD_SCL_MISO_WS/CLKOUT/CT_INP4/SECURE_GPIO0_16/AOI0_OUT3/ADC0_3B}
    - {id: 6, pin_num: '54', pin_signal: PIO0_0/FC3_SCK/CTIMER0_MAT0/SCT_GPI0/PDM_DATA0/SWCLK/SECURE_GPIO0_0/PWM1_B2/EXTTRIG_IN8/ACMP0_A}
    - {id: 8, pin_num: '58', pin_signal: PIO1_13/FC6_RXD_SDA_MOSI_DATA/CT_INP6/USB0_OVERCURRENTN/USB0_FRAME/SCT0_OUT8/QSPI_DIN2/PWM1_X1/AOI0_OUT2/ACMP0VREF}
    - {id: 10, pin_num: '37', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI_DATA/PWM1_A0/TRIGOUT_1}
    - {id: 12, pin_num: '65', pin_signal: PIO1_30/FC7_TXD_SCL_MISO_WS/SCT_GPI7/QSPI_CS0/PWM0_X3/AOI1_OUT3/HSCMP0_OUT}
- id: micro_bus
  name: mikroBUS(TM)
  connectors:
  - id: C1
    name: J7
    pins:
    - {id: 1, pin_num: '25', pin_signal: PIO1_9/FC1_SCK/CT_INP4/SCT0_OUT2/FC4_CTS_SDA_SSEL0/AOI1_OUT3/ADC0_0A/OPAMP0_OUT/HSCMP0_IN4}
    - {id: 2, pin_num: '34', pin_signal: RESETN}
    - {id: 3, pin_num: '73', pin_signal: PIO0_20/FC3_CTS_SDA_SSEL0/CTIMER1_MAT1/CT_INP15/SCT_GPI2/FC7_RXD_SDA_MOSI_DATA/HS_SPI_SSEL0/SECURE_GPIO0_20/FC4_TXD_SCL_MISO_WS/SPI_CS0/PWM1_X2}
    - {id: 4, pin_num: '61', pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT_GPI6/PDM_CLK1/HS_SPI_SCK/PWM0_B0/AOI0_OUT0}
    - {id: 5, pin_num: '62', pin_signal: PIO1_3/CAN0_RD/FC2_TXD_SCL_MISO_WS/SCT0_OUT4/PDM_DATA1/HS_SPI_MISO/USB0_PORTPWRN/PWM0_A3}
    - {id: 6, pin_num: '60', pin_signal: PIO0_26/TAMPER2/FC2_RXD_SDA_MOSI_DATA/CLKOUT/CT_INP14/SCT0_OUT5/PDM_CLK0/USB0_IDVALUE/FC0_SCK/HS_SPI_MOSI/SECURE_GPIO0_26/PWM0_B1}
    - {id: 7, name: 3.3V, external_signal_types: power_supply_3.3V}
    - {id: 8, name: GND, external_signal_types: ground}
  - id: C2
    name: J8
    pins:
    - {id: 1, pin_num: '36', pin_signal: PIO1_8/FC0_CTS_SDA_SSEL0/SCT0_OUT1/FC4_SSEL2/FC1_SCK/PWM0_A2/AOI1_OUT2/TRIGOUT_6}
    - {id: 2, pin_num: '41', pin_signal: PIO0_17/FC4_SSEL2/SCT_GPI7/SCT0_OUT0/FC5_RXD_SDA_MOSI_DATA/QSPI_SCLK/SECURE_GPIO0_17/TRIGOUT_7/HSCMP1_OUT/HSCMP2_IN0}
    - {id: 3, pin_num: '3', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI_DATA/SCT0_OUT1/FC3_SSEL3/AOI0_OUT2/ADC1_8B}
    - {id: 4, pin_num: '3', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI_DATA/SCT0_OUT1/FC3_SSEL3/AOI0_OUT2/ADC1_8B}
    - {id: 5, name: SCL, pin_num: '65', pin_signal: PIO1_30/FC7_TXD_SCL_MISO_WS/SCT_GPI7/QSPI_CS0/PWM0_X3/AOI1_OUT3/HSCMP0_OUT}
    - {id: 6, pin_num: '37', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI_DATA/PWM1_A0/TRIGOUT_1}
    - {id: 7, name: 5V, external_signal_types: power_supply_5V}
    - {id: 8, name: GND, external_signal_types: ground}
external_user_signals: {}
pin_labels:
- {pin_num: '3', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI_DATA/SCT0_OUT1/FC3_SSEL3/AOI0_OUT2/ADC1_8B, label: 'J8[3]/P1_24-FC2_RXD_SDA_DATA'}
- {pin_num: '6', pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/CT_INP2/SCT_GPI4/AOI1_OUT0/ADC1_0B, label: 'J122[14]/P1_0-FC0_RTS-CTIMER_INP2-SCT0_GPI4'}
- {pin_num: '11', pin_signal: PIO1_20/FC7_RTS_SCL_SSEL1/CT_INP14/FC4_TXD_SCL_MISO_WS/PWM0_A0/AOI0_OUT1/ADC1_8A, label: 'J10[15]/P1_20-ADC1_8A-PWM0_A0'}
- {pin_num: '1', pin_signal: PIO2_1/FC0_TXD_SCL_MISO_WS/CTIMER1_MAT0/I3C0_SDA/AOI0_OUT2/OPAMP2_INP, label: P2_1-OPAMP2_INP-FC0_TXD_WS}
- {pin_num: '2', pin_signal: OPAMP2_INN, label: OPAMP2_INN}
- {pin_num: '4', pin_signal: PIO1_7/FC0_RTS_SCL_SSEL1/CTIMER2_MAT2/SCT_GPI4/AOI1_OUT3/ADC1_3B, label: P1_7-ADC1_3B}
- {pin_num: '5', pin_signal: PIO0_1/FC3_CTS_SDA_SSEL0/CT_INP0/SCT_GPI1/PDM_CLK0/CMP0_OUT/SECURE_GPIO0_1/AOI0_OUT1/ADC1_2B, label: P0_1-ADC1_2B}
- {pin_num: '7', pin_signal: ADC1IN1B, label: ADC1IN1B}
- {pin_num: '8', pin_signal: ADC1IN1A, label: ADC1IN1A}
- {pin_num: '9', pin_signal: PIO0_11/FC6_RXD_SDA_MOSI_DATA/CTIMER2_MAT2/FREQME_GPIO_CLK_A/SECURE_GPIO0_11/AOI1_OUT2/ADC1_2A, label: P0_11-ADC1_2A}
- {pin_num: '10', pin_signal: PIO0_12/FC3_TXD_SCL_MISO_WS/FREQME_GPIO_CLK_B/SCT_GPI7/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_12/AOI1_OUT1/ADC1_3A, label: P0_12-ADC1_3A}
- {pin_num: '12', pin_signal: VDDIO_112, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '13', pin_signal: VDDA, label: MCU_VDDA_F}
- {pin_num: '14', pin_signal: VREF_OUT/ADC1IN5A/ADC0IN5A, label: 'J12[16]/MCU_VREF_OUT'}
- {pin_num: '15', pin_signal: VREFP, label: ADC_VREFP}
- {pin_num: '16', pin_signal: VREFN/ADC1IN5B/ADC0IN5B, label: GND}
- {pin_num: '17', pin_signal: VSSA_1, label: GND}
- {pin_num: '18', pin_signal: VSSA_2, label: GND}
- {pin_num: '19', pin_signal: PIO0_23/MCLK/CTIMER1_MAT2/CTIMER3_MAT3/SCT0_OUT4/FC0_CTS_SDA_SSEL0/SECURE_GPIO0_23/ADC0_8B, label: P0_23-ADC0_8B}
- {pin_num: '20', pin_signal: PIO0_16/FC4_TXD_SCL_MISO_WS/CLKOUT/CT_INP4/SECURE_GPIO0_16/AOI0_OUT3/ADC0_3B, label: P0_16-ADC0_3B}
- {pin_num: '21', pin_signal: PIO0_10/FC6_SCK/CT_INP10/CTIMER2_MAT0/FC1_TXD_SCL_MISO_WS/SCT0_OUT2/SECURE_GPIO0_10/ADC0_1A, label: P0_10-ADC0_1A}
- {pin_num: '22', pin_signal: PIO0_15/FC6_CTS_SDA_SSEL0/UTICK_CAP2/CT_INP16/SCT0_OUT2/SECURE_GPIO0_15/ADC0_3A, label: P0_15-ADC0_3A}
- {pin_num: '23', pin_signal: PIO0_31/FC0_CTS_SDA_SSEL0/CTIMER0_MAT1/SCT0_OUT3/SECURE_GPIO0_31/AOI0_OUT0/I3C0_SCL/ADC0_8A, label: P0_31-ADC0_8A}
- {pin_num: '24', pin_signal: PIO2_0/FC0_RXD_SDA_MOSI_DATA/CT_INP4/I3C0_PUR/AOI0_OUT0/ADC0_9A, label: 'J122[2]/P2_0-FC0_RXD_DATA'}
- {pin_num: '25', pin_signal: PIO1_9/FC1_SCK/CT_INP4/SCT0_OUT2/FC4_CTS_SDA_SSEL0/AOI1_OUT3/ADC0_0A/OPAMP0_OUT/HSCMP0_IN4, label: 'J7[1]/P1_9-OPAMP0_Out'}
- {pin_num: '26', pin_signal: PIO0_8/FC3_SSEL3/FC5_RXD_SDA_MOSI_DATA/SWO/PDM_DATA1/SECURE_GPIO0_8/OPAMP0_INP, label: P0_8-OPAMP_INP}
- {pin_num: '27', pin_signal: OPAMP0_INN, label: OPAMP0_INN}
- {pin_num: '28', pin_signal: PIO0_27/FC2_TXD_SCL_MISO_WS/CTIMER3_MAT2/SCT0_OUT6/PDM_DATA0/FC7_RXD_SDA_MOSI_DATA/SECURE_GPIO0_27/SPI_CS1_DIS/OPAMP1_INP, label: P0_27-OPAMP1_INP-PDM_DATA0}
- {pin_num: '29', pin_signal: OPAMP1_INN, label: OPAMP1_INN}
- {pin_num: '30', pin_signal: PIO1_19/SCT0_OUT7/CTIMER3_MAT1/SCT_GPI7/FC4_SCK/QSPI_DIN0/AOI1_OUT2/DAC1_OUT/ADC0_4B/HSCMP1_IN5, label: 'J12[2]/P1_19-DAC1_OUT-ADC0_4B'}
- {pin_num: '31', pin_signal: DAC0_OUT/ADC1IN4A/ADC0IN4A/HSCMP0_IN5, label: 'J12[4]/DAC0_Out'}
- {pin_num: '32', pin_signal: XTAL32M_N, label: XTAL32M_N}
- {pin_num: '33', pin_signal: XTAL32M_P, label: XTAL32M_P}
- {pin_num: '34', pin_signal: RESETN, label: 'J7[2]/J102[6]/U18[8]/MCU_RESET#', identifier: SW2;RESET}
- {pin_num: '35', pin_signal: PIO1_5/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT0/SCT_GPI0/PWM1_A3/TRIGOUT_0/HSCMP0_IN3, label: P1_5-HSCMP0_IN3}
- {pin_num: '36', pin_signal: PIO1_8/FC0_CTS_SDA_SSEL0/SCT0_OUT1/FC4_SSEL2/FC1_SCK/PWM0_A2/AOI1_OUT2/TRIGOUT_6, label: 'J8[1]/P1_8-FC0_CTS-PWM0_A2'}
- {pin_num: '37', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI_DATA/PWM1_A0/TRIGOUT_1, label: 'JP50[2]/P1_21-FC7_SDA-PWM1_A0'}
- {pin_num: '38', pin_signal: VDD_CORE, label: VDD_CORE}
- {pin_num: '39', pin_signal: PIO1_10/FC1_RXD_SDA_MOSI_DATA/CTIMER1_MAT0/SCT0_OUT3/PWM0_X1/TRIGOUT_3/HSCMP2_OUT/HSCMP1_IN3, label: P1_10-HSCMP1_IN3}
- {pin_num: '40', pin_signal: PIO1_22/CTIMER2_MAT3/SCT_GPI5/FC4_SSEL3/CAN0_RD/QSPI_DIN3/PWM0_B1/TRIGOUT_2/HSCMP1_IN1/DAC0_OUT, label: 'JP48[3]/J10[9]/P1_22-HSCMP1_IN1-DAC0_OUT-PWM0_B1_CAN0_RD'}
- {pin_num: '41', pin_signal: PIO0_17/FC4_SSEL2/SCT_GPI7/SCT0_OUT0/FC5_RXD_SDA_MOSI_DATA/QSPI_SCLK/SECURE_GPIO0_17/TRIGOUT_7/HSCMP1_OUT/HSCMP2_IN0, label: 'JP73[2]/J8[2]/P0_17',
  identifier: SW3;USR}
- {pin_num: '42', pin_signal: PIO0_7/FC3_RTS_SCL_SSEL1/FC5_SCK/FC1_SCK/PDM_CLK0/MCLK/QSPI_CS0/SECURE_GPIO0_7/PWM0_B0/TRIGOUT_6/HSCMP2_OUT/HSCMP1_IN0, label: P0_7-PDM_CLK0_ISP1,
  identifier: ISP1}
- {pin_num: '43', pin_signal: VDDIO_143, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '63', pin_signal: VDDIO_263, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '74', pin_signal: VDDIO_274, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '85', pin_signal: VDDIO_285, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '96', pin_signal: VDDIO_296, label: 'JP20[2]/MCU_VDD'}
- {pin_num: '44', pin_signal: VSS_MAIN_PWR, label: GND}
- {pin_num: '45', pin_signal: VSS_MAIN, label: GND}
- {pin_num: '100', pin_signal: USB0_VSS, label: GND}
- {pin_num: '46', pin_signal: LX, label: LX}
- {pin_num: '47', pin_signal: VDD_MAIN_PWR, label: 'JP28[2]/MCU_MAIN'}
- {pin_num: '48', pin_signal: VDD_MAIN, label: 'JP28[2]/MCU_MAIN'}
- {pin_num: '49', pin_signal: PIO1_23/FC2_SCK/SCT0_OUT0/FC3_SSEL2/PWM1_A1/TRIGOUT_4/HSCMP2_IN1, label: 'JP51[2]/P1_23-FC2_SCK-PWM1_A1'}
- {pin_num: '50', pin_signal: PIO1_6/FC0_TXD_SCL_MISO_WS/CTIMER2_MAT1/SCT_GPI3/PWM0_A1/TRIGOUT_5/HSCMP0_OUT, label: 'J10[11]/P1_6-PWM0_A1'}
- {pin_num: '51', pin_signal: XTAL32K_P, label: XTAL32K_P}
- {pin_num: '52', pin_signal: XTAL32K_N, label: XTAL32K_N}
- {pin_num: '53', pin_signal: VBAT, label: 'JP22[2]/J20[1]/MCU_VBAT'}
- {pin_num: '54', pin_signal: PIO0_0/FC3_SCK/CTIMER0_MAT0/SCT_GPI0/PDM_DATA0/SWCLK/SECURE_GPIO0_0/PWM1_B2/EXTTRIG_IN8/ACMP0_A, label: 'J132[6]/U18[4]/P0_0-SWCLK-ACMP0_A',
  identifier: DEBUG_SWD_SWDCLK}
- {pin_num: '55', pin_signal: PIO0_9/FC3_SSEL2/FC5_TXD_SCL_MISO_WS/I3C0_SCL/SWDIO/SECURE_GPIO0_9/PWM1_A2/TRIGOUT_2/ACMP0_B, label: 'U18[16]/P0_9-I3C0_SCL-SWDIO',
  identifier: I3C0_SCL;DEBUG_SWD_SWDIO}
- {pin_num: '56', pin_signal: PIO0_18/FC4_CTS_SDA_SSEL0/CTIMER1_MAT0/SCT0_OUT1/FC5_RXD_SDA_MOSI_DATA/SWO/SECURE_GPIO0_18/PWM1_A0/QSPI_DIN1/TRIGOUT_7/ACMP0_C, label: 'U18[12]/P0_18-SWO-PWM1_A0',
  identifier: DEBUG_SWD_SWO}
- {pin_num: '57', pin_signal: PIO1_14/UTICK_CAP2/CTIMER1_MAT2/FC5_CTS_SDA_SSEL0/USB0_LEDN/PWM0_B3/QSPI_DIN0/EXTTRIG_IN9/ACMP0_D, label: 'J44[21]/P1_14'}
- {pin_num: '58', pin_signal: PIO1_13/FC6_RXD_SDA_MOSI_DATA/CT_INP6/USB0_OVERCURRENTN/USB0_FRAME/SCT0_OUT8/QSPI_DIN2/PWM1_X1/AOI0_OUT2/ACMP0VREF, label: 'J132[8]/P1_13'}
- {pin_num: '59', pin_signal: PIO1_1/TAMPER0/FC3_RXD_SDA_MOSI_DATA/CT_INP3/SCT_GPI5/HS_SPI_SSEL1/TRACECLK/RTC_ALARMOUT/PWM0_B2, label: 'JP76[2]/P1_1-HS_SPI_SSEL1-TRACECLK'}
- {pin_num: '60', pin_signal: PIO0_26/TAMPER2/FC2_RXD_SDA_MOSI_DATA/CLKOUT/CT_INP14/SCT0_OUT5/PDM_CLK0/USB0_IDVALUE/FC0_SCK/HS_SPI_MOSI/SECURE_GPIO0_26/PWM0_B1, label: 'J92[8]/J7[6]/P0_26-HS_SPI_MOSI-USB0_IDVALUE'}
- {pin_num: '61', pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT_GPI6/PDM_CLK1/HS_SPI_SCK/PWM0_B0/AOI0_OUT0, label: 'JP49[1]/J41[5]/J92[12]/J7[4]/P1_2-CAN0_TD-PDM_CLK1-HS_SPI_SCK',
  identifier: CAN_TXD}
- {pin_num: '62', pin_signal: PIO1_3/CAN0_RD/FC2_TXD_SCL_MISO_WS/SCT0_OUT4/PDM_DATA1/HS_SPI_MISO/USB0_PORTPWRN/PWM0_A3, label: 'JP48[1]/J41[6]/J92[10]/J7[5]/P1_3-CAN0_RD-PDM_DATA1-HS_SPI_MISO',
  identifier: CAN_RXD}
- {pin_num: '64', pin_signal: PIO1_18/TAMPER3/SCT0_OUT5/RTC_ALARMOUT/PWM0_A2/QSPI_DIN3/HSCMP2_OUT, label: P1_18-WAKEUP2-TAMPER3, identifier: SW1;WK_TMP}
- {pin_num: '65', pin_signal: PIO1_30/FC7_TXD_SCL_MISO_WS/SCT_GPI7/QSPI_CS0/PWM0_X3/AOI1_OUT3/HSCMP0_OUT, label: 'J41[13]/J8[5]/J132[12]/P1_30-FC7_SCL'}
- {pin_num: '66', pin_signal: PIO0_28/TAMPER1/FC0_SCK/CT_INP11/SCT0_OUT7/TRACEDATA3/USB0_OVERCURRENTN/I3C0_PUR/SECURE_GPIO0_28/PWM0_A2/QSPI_CS0_DIS, label: P0_28-FC0_SCK-TRACED3-I3C0_PUR-USB0_OVERCUR}
- {pin_num: '67', pin_signal: PIO1_12/FC6_SCK/CTIMER1_MAT1/USB0_PORTPWRN/HS_SPI_SSEL2/QSPI_SCLK/PWM0_A3/AOI0_OUT1/EXTTRIG_IN9/HSCMP0_IN1, label: 'Q1[1]/P1_12-FS_USB0_PWR_EN#'}
- {pin_num: '68', pin_signal: PIO1_26/FC2_CTS_SDA_SSEL0/SCT0_OUT3/CT_INP3/UTICK_CAP1/HS_SPI_SSEL3/PWM0_A1/QSPI_CS1_DIS/AOI1_OUT2, label: 'J92[6]/J122[6]/P1_26-HS_SPI_SSEL3'}
- {pin_num: '69', pin_signal: PIO0_24/FC0_RXD_SDA_MOSI_DATA/CT_INP8/SCT_GPI0/I3C0_SDA/TRACEDATA0/SECURE_GPIO0_24/PWM0_A1/SPI_CS0_DIS/PWM0_X0/HSCMP0_IN0, label: 'JP77[2]/P0_24-I3C0_SDA-TRACED0'}
- {pin_num: '70', pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CT_INP0/SCT_GPI0/FC1_RXD_SDA_MOSI_DATA/SECURE_GPIO0_13/EXTTRIG_IN3, label: 'J10[3]/U27[1]/P0_13-FC1_SDA-SCT0_GPI0-EXTTRIG_IN3'}
- {pin_num: '71', pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CT_INP1/SCT_GPI1/FC1_TXD_SCL_MISO_WS/SECURE_GPIO0_14/EXTTRIG_IN2, label: 'J10[1]/U27[8]/P0_14-FC1_SCL-SCT0_GPI1-EXTTRIG_IN2'}
- {pin_num: '72', pin_signal: PIO1_28/FC7_SCK/CT_INP2/TRIGOUT_4/PWM1_X3/SPI_CS1_DIS/HSCMP1_OUT, label: 'J122[16]/P1_28', identifier: LED_RED}
- {pin_num: '73', pin_signal: PIO0_20/FC3_CTS_SDA_SSEL0/CTIMER1_MAT1/CT_INP15/SCT_GPI2/FC7_RXD_SDA_MOSI_DATA/HS_SPI_SSEL0/SECURE_GPIO0_20/FC4_TXD_SCL_MISO_WS/SPI_CS0/PWM1_X2,
  label: 'J7[3]/P0_20-HS_SPI_SSEL0-CTIMER_INP15-SCT0_GPI2'}
- {pin_num: '75', pin_signal: PIO1_4/FC0_SCK/CTIMER2_MAT1/SCT0_OUT0/FREQME_GPIO_CLK_A/FC4_TXD_SCL_MISO_WS/SPI_DIN/PWM0_B2/TRIGOUT_7/EXTTRIG_IN8, label: 'J10[5]/P1_4-PWM0_B2'}
