nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso55s36/common/pin_mux/pin_mux.c
- {pin_num: '76', pin_signal: PIO0_21/FC3_RTS_SCL_SSEL1/UTICK_CAP3/CTIMER3_MAT3/SCT_GPI3/SCT0_OUT7/FLEXSPI0_SS0_N/FC7_SCK/HS_SPI_SSEL3/FC7_CTS_SDA_SSEL0/SECURE_GPIO0_21/PWM1_B1/TRIGOUT_4/EXTTRIG_IN7,
  label: 'JP45[2]/P0_21-FLEXSPI0_SS0_N-PWM1_B1'}
- {pin_num: '77', pin_signal: PIO1_25/FC2_TXD_SCL_MISO_WS/SCT0_OUT2/UTICK_CAP0/PWM1_A2/SPI_SCLK/AOI0_OUT3, label: 'JP52[2]/P1_25-FC2_TXD_SCL_MISO_WS-PWM1_A2'}
- {pin_num: '78', pin_signal: PIO0_22/FC6_TXD_SCL_MISO_WS/UTICK_CAP1/CT_INP15/SCT0_OUT3/FLEXSPI0_SCLK_N/FLEXSPI0_SS1_N/USB0_VBUS/FC7_RTS_SCL_SSEL1/SECURE_GPIO0_22/PWM1_X0/EXTTRIG_IN5,
  label: 'J12[8]/JP72[2]/P0_22', identifier: LED_GREEN}
- {pin_num: '79', pin_signal: PIO0_25/FC0_TXD_SCL_MISO_WS/CT_INP9/SCT_GPI1/FLEXSPI0_DQS/HSCMP0_OUT/SECURE_GPIO0_25/PWM0_A0/EXTTRIG_IN6, label: 'JP43[2]/P0_25-FLEXSPI0_DQS-EXTTRIG_IN6'}
- {pin_num: '80', pin_signal: PIO1_29/FC7_RXD_SDA_MOSI_DATA/SCT_GPI6/FLEXSPI0_DATA7/PWM0_X2/EXTTRIG_IN9, label: 'JP64[2]/P1_29-FLEXSPI0_D7-GPIO'}
- {pin_num: '81', pin_signal: PIO0_2/FC3_TXD_SCL_MISO_WS/CT_INP1/SCT0_OUT0/SCT_GPI2/FLEXSPI0_DATA3/SECURE_GPIO0_2/PWM0_A2/TRIGOUT_3/EXTTRIG_IN4, label: 'JP41[2]/P0_2-FC3_TXD_SCL_MISO_WS-FLEXSPI0_D3-EXTTRIG_IN4'}
- {pin_num: '82', pin_signal: PIO1_15/UTICK_CAP3/CT_INP7/FC5_RTS_SCL_SSEL1/FC4_RTS_SCL_SSEL1/FLEXSPI0_DATA5/FC1_SCK/QSPI_CS0_DIS/PWM0_B0/EXTTRIG_IN8, label: 'JP67[1]/P1_15'}
- {pin_num: '83', pin_signal: PIO0_19/FC4_RTS_SCL_SSEL1/UTICK_CAP0/CTIMER0_MAT2/SCT0_OUT2/FLEXSPI0_SCLK/FC7_TXD_SCL_MISO_WS/FC7_SCK/SECURE_GPIO0_19/PWM0_B1/TRIGOUT_5/EXTTRIG_IN0,
  label: 'JP68[1]/P0_19'}
- {pin_num: '84', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI_DATA/CTIMER0_MAT1/SCT0_OUT1/SCT_GPI3/FLEXSPI0_DATA2/SECURE_GPIO0_3/PWM1_B0, label: 'JP44[2]/P0_3-FC3_RXD_SDA_MOSI_DATA-FLEXSPI0_D2-TCK-PWM1_B0'}
- {pin_num: '86', pin_signal: PIO1_27/FC2_RTS_SCL_SSEL1/CTIMER0_MAT3/CLKOUT/FLEXSPI0_DATA6/CAN0_TD/PWM1_B2, label: 'JP65[2]/P1_27-CLKOUT-FLEXSPI0_D6'}
- {pin_num: '87', pin_signal: PIO0_4/CAN0_RD/FC4_SCK/CT_INP12/SCT_GPI4/FLEXSPI0_DATA1/FC3_CTS_SDA_SSEL0/FC7_TXD_SCL_MISO_WS/SECURE_GPIO0_4/PWM0_B3/EXTTRIG_IN2, label: 'JP69[1]/P0_4'}
- {pin_num: '88', pin_signal: PIO1_16/FC6_TXD_SCL_MISO_WS/CTIMER1_MAT3/FLEXSPI0_DATA4/FC1_RXD_SDA_MOSI_DATA/QSPI_CS1_DIS/PWM0_B2/EXTTRIG_IN7, label: 'JP66[1]/P1_16-FC6_TXD_SCL_MISO_WS-FLEXSPI0_D4'}
- {pin_num: '89', pin_signal: PIO0_6/FC3_SCK/CT_INP13/CTIMER4_MAT0/SCT_GPI6/FLEXSPI0_DATA0/SCT0_OUT6/FC7_RXD_SDA_MOSI_DATA/SECURE_GPIO0_6/PWM0_B0/EXTTRIG_IN1, label: 'JP42[2]/P0_6-FLEXSPI0_D0-EXTTRIG_IN1'}
- {pin_num: '90', pin_signal: PIO0_5/CAN0_TD/FC4_RXD_SDA_MOSI_DATA/CTIMER3_MAT0/SCT_GPI5/FC3_RTS_SCL_SSEL1/MCLK/SECURE_GPIO0_5/PWM0_A0/EXTTRIG_IN5, label: 'J38[7]/P0_5-ISP0',
  identifier: ISP0}
- {pin_num: '91', pin_signal: PIO1_17/FC6_RTS_SCL_SSEL1/SCT0_OUT4/PWM0_B0/AOI1_OUT3, label: 'J10[13]/P1_17-PWM0_B0'}
- {pin_num: '92', pin_signal: PIO1_31/MCLK/CTIMER0_MAT2/SCT0_OUT6/USB0_VBUS/PWM1_B2/EXTTRIG_IN2, label: 'JP46[2]/P1_31-USB0_VBUS-MCLK-PWM1_B2'}
- {pin_num: '93', pin_signal: PIO0_29/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT3/SCT0_OUT8/TRACEDATA2/FC6_RXD_SDA_MOSI_DATA/CMP0_OUT/SECURE_GPIO0_29/PWM0_A1/SPI_DIN/EXTTRIG_IN3,
  label: 'JP78[2]/P0_29-FC0_RXD_SDA_MOSI_DATA-TRACED2', identifier: DEBUG_UART_RX}
- {pin_num: '94', pin_signal: PIO1_11/FC1_TXD_SCL_MISO_WS/CT_INP5/USB0_VBUS/HS_SPI_SSEL0/FC6_SCK/PWM0_A0/SPI_SCLK/EXTTRIG_IN8, label: 'J12[3]/P1_11-CTIMER_INP5-EXTTRIG_IN8',
  identifier: LED_BLUE}
- {pin_num: '95', pin_signal: PIO0_30/FC0_TXD_SCL_MISO_WS/CTIMER0_MAT0/SCT0_OUT9/TRACEDATA1/CAN0_TD/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_30/PWM1_A1/AOI1_OUT0, label: 'JP49[3]/JP80[2]/P0_30-FC0_TXD_SCL_MISO_WS-TRACED1-CAN0_TD',
  identifier: DEBUG_UART_TX}
- {pin_num: '97', pin_signal: USB0_3V3, label: USB0_FS}
- {pin_num: '98', pin_signal: USB0_DP, label: FS_USB0_DP, identifier: USB0_DP}
- {pin_num: '99', pin_signal: USB0_DM, label: FS_USB0_DM, identifier: USB0_DM}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '93', peripheral: FLEXCOMM0, signal: RXD_SDA_MOSI_DATA, pin_signal: PIO0_29/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT3/SCT0_OUT8/TRACEDATA2/FC6_RXD_SDA_MOSI_DATA/CMP0_OUT/SECURE_GPIO0_29/PWM0_A1/SPI_DIN/EXTTRIG_IN3,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '95', peripheral: FLEXCOMM0, signal: TXD_SCL_MISO_WS, pin_signal: PIO0_30/FC0_TXD_SCL_MISO_WS/CTIMER0_MAT0/SCT0_OUT9/TRACEDATA1/CAN0_TD/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_30/PWM1_A1/AOI1_OUT0,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    const uint32_t DEBUG_UART_RX = (/* Pin is configured as FC0_RXD_SDA_MOSI_DATA */
                                    IOCON_PIO_FUNC1 |
                                    /* No addition pin function */
                                    IOCON_PIO_MODE_INACT |
                                    /* Standard mode, output slew rate control is enabled */
                                    IOCON_PIO_SLEW_STANDARD |
                                    /* Input function is not inverted */
                                    IOCON_PIO_INV_DI |
                                    /* Enables digital function */
                                    IOCON_PIO_DIGITAL_EN |
                                    /* Open drain is disabled */
                                    IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN29 (coords: 93) is configured as FC0_RXD_SDA_MOSI_DATA */
    IOCON_PinMuxSet(IOCON, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN, DEBUG_UART_RX);

    const uint32_t DEBUG_UART_TX = (/* Pin is configured as FC0_TXD_SCL_MISO_WS */
                                    IOCON_PIO_FUNC1 |
                                    /* No addition pin function */
                                    IOCON_PIO_MODE_INACT |
                                    /* Standard mode, output slew rate control is enabled */
                                    IOCON_PIO_SLEW_STANDARD |
                                    /* Input function is not inverted */
                                    IOCON_PIO_INV_DI |
                                    /* Enables digital function */
                                    IOCON_PIO_DIGITAL_EN |
                                    /* Open drain is disabled */
                                    IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN30 (coords: 95) is configured as FC0_TXD_SCL_MISO_WS */
    IOCON_PinMuxSet(IOCON, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN, DEBUG_UART_TX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWD_DEBUGPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '54', peripheral: SWD, signal: SWCLK, pin_signal: PIO0_0/FC3_SCK/CTIMER0_MAT0/SCT_GPI0/PDM_DATA0/SWCLK/SECURE_GPIO0_0/PWM1_B2/EXTTRIG_IN8/ACMP0_A, mode: pullDown,
    slew_rate: standard, invert: disabled, open_drain: disabled, asw0: disabled}
  - {pin_num: '55', peripheral: SWD, signal: SWDIO, pin_signal: PIO0_9/FC3_SSEL2/FC5_TXD_SCL_MISO_WS/I3C0_SCL/SWDIO/SECURE_GPIO0_9/PWM1_A2/TRIGOUT_2/ACMP0_B, mode: pullUp,
    slew_rate: standard, invert: disabled, open_drain: disabled, asw0: disabled}
  - {pin_num: '56', peripheral: SWD, signal: SWO, pin_signal: PIO0_18/FC4_CTS_SDA_SSEL0/CTIMER1_MAT0/SCT0_OUT1/FC5_RXD_SDA_MOSI_DATA/SWO/SECURE_GPIO0_18/PWM1_A0/QSPI_DIN1/TRIGOUT_7/ACMP0_C,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled, asw0: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

